# Задача №1. Закрепляем математические операторы
# На садовом участке площадью 10 соток, разбили грядки 15 на 25 метров. Сколько м2 осталось незанято?
# Результат работы программы вывести на экран.
area = 10
beds_x = 15
beds_y = 25
print((area * 100) % (beds_x * beds_y))
